Tekla.Structures.Model.Internal.CancellableProgressReportCallback
Progress report callback client.

Tekla.Structures.Model.Internal.CancellableProgressReportCallback.CancelableCallback
The delegate to call when the progress is updated.

Tekla.Structures.Model.Internal.CancellableProgressReportCallback.#ctor(Tekla.Structures.Model.Internal.CancellableProgressReportDelegate)
Creates a new instance of the Tekla.Structures.Model.Internal.CancellableProgressReportCallback class.
callback: The delegate to call when the progress is updated.

Tekla.Structures.Model.Internal.CancellableProgressReportCallback.OnCnacelanbleProgressChanged(System.String,System.Int32)
